#!/usr/bin/env ruby

$LOAD_PATH.push( File.expand_path( __FILE__ ) )
require_relative 'myYomiJuman'
# require_relative 'myYomiJumanpp'

$YOMI_DB_CACHE = { }

# 先頭文字の濁点・半濁点の補正
$Dakuten_handakuten_HASH = { # 濁点・半濁点変換他
  "ぁ"   => "あ", "ぃ"  => "い", "ぅ"   => "う", "ぇ"   => "え", "ぉ"  => "お",
  "が"   => "か", "ぎ"  => "き", "ぐ"   => "く", "げ"   => "け", "ご"  => "こ",
  "ざ"   => "さ", "じ"  => "し", "ず"   => "す", "ぜ"   => "せ", "ぞ"  => "そ",
  "だ"   => "た", "ぢ"  => "ち", "づ"   => "つ", "で"   => "て", "ど"  => "と",
  "ば"   => "は", "び"  => "ひ", "ぶ"   => "ふ", "べ"   => "へ", "ぼ"  => "ほ",
  "ぱ"   => "は", "ぴ"  => "ひ", "ぷ"   => "ふ", "ぺ"   => "へ", "ぽ"  => "ほ",
  "ゃ"   => "や",                "ゅ"  => "ゆ",                 "ょ"  => "よ",

  "っ"   => "つ", "ゐ"  => "い",                "ゑ"   => "え",

  "ゔぁ" => "ば", "ゔぃ" => "び", "ゔぅ" => "ぶ", "ゔぇ" => "べ", "ゔぉ" => "ぼ",

  "Ä" => "A", "Ö" => "O", "Ü" => "U", "ß" => "S",
  "ä" => "A", "ö" => "O", "ü" => "U",
}
# 英数字が先頭に来る場合、tr では全部変えてしまうのでこの変換テーブルに登録しておく
[ [ "0", "9", "０-９" ],
  [ "A", "Z", "Ａ-Ｚ" ],
  [ "a", "z", "ａ-ｚ" ],
].each do | ee |
  ( ee[0] .. ee[1] ).each do |i|
    ii = i.tr( "#{ee[0]}-#{ee[1]}", ee[2] )
    $Dakuten_handakuten_HASH[ ii ] = i.tr( "a-z", "A-Z" )
  end
end

def myYomi( str )

  arr = []
  arr.push( $YOMI_DB_CACHE[ str ] )# TODO キャッシュに使えるようにする

  if arr[0].nil? # よみがキャッシュにない時は jumanで変換
    arr = []
    if str =~ /[\p{hani}\p{kana}]/
      arr.push( myYomiJuman( yomi_sub( str ) ) )
      $YOMI_DB_CACHE = { str => arr[-1] }
    else
      arr.push( str )
    end
  end

  # 先頭の１文字が濁点・半濁点など対象文字を
  mm = arr[0].match( /^(.)/ )
  nn = $Dakuten_handakuten_HASH[mm[1]]
  nn = mm[1] if nn.nil?

  [ nn, arr.join, ].join( "-" )
end

$Yomi_bubun_henkan_HASH = {
  "あの人" => "あのひと",
  "あの国" => "あのくに",
  "あの白い月を" => "あのしろいつきを",
  "あの門の外から" => "あのもんのそとから",
  "お守り" => "おまもり",
  "お小姓" => "おこしよう",
  "お月さま" => "おつきさま",
  "お眼々" => "おめめ",
  "さすらい人" => "さすらいびと",
  "万霊節" => "ばんれいせつ",
  "世捨て人" => "よすてびと",
  "人にもきたるものなれば" => "ひとにもきたるものなれば",
  "人はしらふでいる間は" => "ひとはしらふでいるあいだは",
  "儀式" => "ぎしき",
  "光の中" => "ひかりのなか",
  "初めて" => "はじめて",
  "劇唱" => "げきしょう",
  "囚われた" => "とらわれた",
  "四十歳" => "よんじゅうさい",
  "四重唱" => "しじゅうしょう",
  "回癒" => "かいゆ",
  "大切な方" => "たいせつなかた",
  "女の人たち" => "おんなのひとたち",
  "寄す" => "よす",
  "小鳥" => "ことり",
  "山黄蝶" => "やまきちよう",
  "御子" => "みこ",
  "思い" => "おもい",
  "悪い人たちはみな" => "わるいひとたちはみな",
  "愛し" => "いとし",
  "愛しい人" => "いとしいひと",
  "愛する" => "あいする",
  "愛する人" => "あいするひと",
  "憧れ" => "あこがれ",
  "憧れの中" => "あこがれのなか",
  "擲弾" => "てきだん",
  "明るい月" => "あかるいつき",
  "明日" => "あした",
  "月明り" => "つきあかり",
  "来た" => "きた",
  "来て" => "きて",
  "東風" => "こち",
  "森の中" => "もりのなか",
  "楡の木" => "にれのき",
  "樹々" => "きぎ",
  "毛虱" => "けじらみ",
  "汝" => "なんじ",
  "漁師" => "りょうし",
  "爽やか" => "さわやか",
  "牡山羊" => "おすひつじ",
  "献呈" => "けんてい",
  "生きる人" => "いきるひと",
  "真夜中" => "まよなか",
  "石割人" => "いしわりびと",
  "禍い" => "わざわい",
  "秋に" => "あきに",
  "秋の" => "あきの",
  "耽溺" => "たんでき",
  "聖歌曲集" => "せいかきょくしゅう",
  "荒くれた" => "あらくれた",
  "裏切者" => "うらぎりもの",
  "西風" => "にしかぜ",
  "賤し" => "いやし",
  "連祷" => "れんとう",
  "雪の鈴花" => "ゆきのすずはな",
  "風の吹く" => "かぜのふく",
  "風見" => "かざみ",
  "飽く" => "あく",
  "馭者" => "ぎょしゃ",
  "魔王" => "まおう",
  "１１" => "じゅういち",
  "１５" => "じゅうご",
  "一匹" => "いっぴき",
  "一度" => "いちど",
  "一日" => "いちにち",
  "一本" => "いっぽん",
  "一枚" => "いちまい",
  "一粒" => "ひとつぶ",
  "一軒" => "いっけん",
  "１つ" => "ひとつ",   "一つ" => "ひとつ",  "一人" => "ひとり",
  "２つ" => "ふたつ",   "二つ" => "ふたつ",  "二人" => "ふたり",
  "３つ" => "みっつ",   "三つ" => "みっつ",  "三人" => "さんにん", "三月" => "さんがつ",
  "４つ" => "よっつ",   "四つ" => "よっつ",  "四人" => "よにん",   "四月" => "しがつ",
  "５つ" => "いつつ",   "五つ" => "いつつ",  "五人" => "ごにん",   "五月" => "ごがつ",
  "６つ" => "むっつ",   "六つ" => "むっつ",
  "７つ" => "ななつ",   "七つ" => "ななつ",  "七人" => "ななにん",
  "８つ" => "やっつ",   "八つ" => "やっつ",
  "９つ" => "ここのつ", "九つ" => "ここのつ", "九人" => "くにん",   "九月" => "くがつ",#
 }

def yomi_sub( ss )
  #`gsub!': can't modify frozen String: "XXX" (FrozenError)

  ss =
    ss.gsub( /(#{$Yomi_bubun_henkan_HASH.keys.join( '|' )})/,
             $Yomi_bubun_henkan_HASH )
      .gsub( /([^IV])I{1}$/  , '\1 1' ).gsub( /([^IV])I{1}([^IV])/  , '\1 1 \2' )
      .gsub( /([^IV])I{2}$/  , '\1 2' ).gsub( /([^IV])I{2}([^IV])/  , '\1 2 \2' )
      .gsub( /([^IV])I{3}$/  , '\1 3' ).gsub( /([^IV])I{3}([^IV])/  , '\1 3 \2' )
      .gsub( /([^IV])IV{1}$/ , '\1 4' ).gsub( /([^IV])IV{1}([^IV])/ , '\1 4 \2' )
      .gsub( /([^IV])V{1}$/  , '\1 5' ).gsub( /([^IV])V{1}([^IV])/  , '\1 5 \2' )
      .sub(  /^春/, 'はる' ).gsub( /(\p{hira})春(\p{hira})/, '\1はる\2' )
      .sub(  /^夏/, 'なつ' ).gsub( /(\p{hira})夏(\p{hira})/, '\1なつ\2' )
      .sub(  /^秋/, 'あき' ).gsub( /(\p{hira})秋(\p{hira})/, '\1あき\2' )
      .sub(  /^冬/, 'ふゆ' ).gsub( /(\p{hira})冬(\p{hira})/, '\1ふゆ\2' )
      .sub(  /^月/, 'つき' ).gsub( /(\p{hira})月(\p{hira})/, '\1つき\2' )
      .gsub( /「([^「」]+)」/, '\1' )
      .gsub( /『([^『』]+)』/, '\1' )
      .gsub( /（([^（）]+)）/, '\1' )
      .gsub( /[[:space:]]/, '' )

  ss
end

if __FILE__ == $0 then
  ARGV.each do | argv |
    puts [ "",
           argv,
           myYomi( argv )
         ].join( "\n" )
  end
end
