#!/usr/bin/env ruby

def main
end

def read_toml_file( ftoml )

  unless File.file?( ftoml ) then return end

  subj = Tomlrb.load_file( ftoml )

  subj['COMP'].each do | comp |

    page = read_html_from_url_to_file( comp['url'] )

    page.xpath( '//a' ).each do | node |

      next unless node.first[1] =~ /htm$/

      m1     =   comp['url'].split( "/" )
      m2     = node.first[1].split( "/" )
      m1[-2] = m2[-2]
      m1[-1] = m2[-1]
      url    = m1.join( '/' )

      read_html_from_url_to_file( url )
    end
  end
end

def myYomi(str)

  # TODO toml ファイルをキャッシュに使えるようにする
  # TODO 返す最初の文字の濁点や半濁点などの処理

  arr = []
  arr.push( yomi_sub_hash(str).to_s )

  if arr[0].nil?
    if str =~ /^\p{hira}+$/
      arr.push( str )
    else
      jumanpp = JumanppRuby::Juman.new( force_single_path: :true )
      jumanpp.parse(NKF.nkf("--hiragana -w", yomi_sub(str)) ) do |word|
        arr.push(word[1])
      end
    end
  end

  dakuten_handakuten_HASH = {
    "ぁ" => "あ", "ぃ" => "い", "ぅ" => "う", "ぇ" => "え", "ぉ" => "お",
    "が" => "か", "ぎ" => "き", "ぐ" => "く", "げ" => "け", "ご" => "こ",
    "ざ" => "さ", "じ" => "し", "ず" => "す", "ぜ" => "せ", "ぞ" => "そ",
    "だ" => "た", "ぢ" => "ち", "づ" => "つ", "で" => "て", "ど" => "と",
    "ば" => "は", "び" => "ひ", "ぶ" => "ふ", "べ" => "へ", "ぼ" => "ほ",
    "ぱ" => "は", "ぴ" => "ひ", "ぷ" => "ふ", "ぺ" => "へ", "ぽ" => "ほ",
    "ゃ" => "や",              "ゅ" => "ゆ",              "ょ" => "よ",
    "っ" => "つ", "ゐ" => "い", "ゑ" => "え", "ゔ" => "う",
  }
  # 先頭の１文字だけ濁点・半濁点を変換
  re = dakuten_handakuten_HASH.keys.join('|') # ぁ|ぃ|...|ゔ

  m = arr[0].match(/^([#{re}])/)
  arr[0].sub(/^#{m[0]}/, dakuten_handakuten_HASH[m[0]]) if m

  arr.join
    .gsub( /ゔぁ/, 'ば' )
    .gsub( /ゔぃ/, 'び' )
    .gsub( /ゔぅ/, 'ぶ' )
    .gsub( /ゔぇ/, 'べ' )
    .gsub( /ゔぉ/, 'ぼ' )
    .gsub( /ＸＸＸ/, 'XXX' )
    .gsub( /[\\\b]/, '' )
end

def yomi_sub(str)
  str
    .gsub( /([^IV])I{1}$/  , '\1 1' ).gsub( /([^IV])I{1}([^IV])/  , '\1 1 \2' )
    .gsub( /([^IV])I{2}$/  , '\1 2' ).gsub( /([^IV])I{2}([^IV])/  , '\1 2 \2' )
    .gsub( /([^IV])I{3}$/  , '\1 3' ).gsub( /([^IV])I{3}([^IV])/  , '\1 3 \2' )
    .gsub( /([^IV])IV{1}$/ , '\1 4' ).gsub( /([^IV])IV{1}([^IV])/ , '\1 4 \2' )
    .gsub( /([^IV])V{1}$/  , '\1 5' ).gsub( /([^IV])V{1}([^IV])/  , '\1 5 \2' )
    .sub( /^春/, 'はる' )
    .sub( /^月/, 'つき' )
    .sub( /^１５/, 'しゅうご' )
    .gsub( /(\p{hira})春(\p{hira})/, '\1はる\2' )
    .gsub( /「([^「」]+)」/ , '\1' )
    .gsub( /（([^（）]+)）/ , '\1' )
    .gsub( /愛する/                 , 'あいする' )
    .gsub( /愛する人/               , 'あいするひと' )
    .gsub( /明るい月/               , 'あかるいつき' )
    .gsub( /^秋$/                   , 'あき' )
    .gsub( /秋に/                   , 'あきに' )
    .gsub( /秋の/                   , 'あきの' )
    .gsub( /飽く/                   , 'あく' )
    .gsub( /憧れ/                   , 'あこがれ' )
    .gsub( /(憧れ|あこがれ)の中/    , 'あこがれの中' )
    .gsub( /明日/                   , 'あした' )
    .gsub( /あの白い月を/           , 'あのしろいつきを' )
    .gsub( /あの人/                 , 'あのひと' )
    .gsub( /あの門の外から/         , 'あのもんのそとから' )
    .gsub( /あの国/                 , 'あの国' )
    .gsub( /生きる人/               , 'いきるひと' )
    .gsub( /石割人/                 , 'いしわりびと' )
    .gsub( /一度/                   , 'いちど' )
    .gsub( /一日/                   , 'いちにち' )
    .gsub( /一枚/                   , 'いちまい' )
    .gsub( /一軒/                   , 'いっけん' )
    .gsub( /一匹/                   , 'いっぴき' )
    .gsub( /一本/                   , 'いっぽん' )
    .gsub( /５つ/                   , 'いつつ' )
    .gsub( /愛し/                   , 'いとし' )
    .gsub( /(愛|いと)しい人/         , 'いとしいひと' )
    .gsub( /賤し/                   , 'いやし' )
    .gsub( /裏切者/                 , 'うらぎりもの' )
    .gsub( /お小姓/                 , 'おこしよう' )
    .gsub( /牡山羊/                 , 'おすひつじ' )
    .gsub( /お月さま/               , 'おつきさま' )
    .gsub( /お守り/                 , 'おまもり' )
    .gsub( /お眼々/                 , 'おめめ' )
    .gsub( /思い/                   , 'おもい' )
    .gsub( /女の人たち/             , 'おんなのひとたち' )
    .gsub( /回癒/                   , 'かいゆ' )
    .gsub( /風見/                   , 'かざみ' )
    .gsub( /風の吹く/         , 'かぜのふく' )
    .gsub( /樹々/                   , 'きぎ' )
    .gsub( /来た/                   , 'きた' )
    .gsub( /来て/                   , 'きて' )
    .gsub( /儀式/                   , 'ぎしき' )
    .gsub( /九月/                   , 'くがつ' )
    .gsub( /毛虱/                   , 'けじらみ' )
    .gsub( /劇唱/                   , 'げきしょう' )
    .gsub( /献呈/                   , 'けんてい' )
    .gsub( /９つ/                   , 'ここのつ' )
    .gsub( /東風/                   , 'こち' )
    .gsub( /小鳥/                   , 'ことり' )
    .gsub( /五月/                   , 'ごがつ' )
    .gsub( /さすらい人/             , 'さすらいひと' )
    .gsub( /爽やか/                 , 'さわやか' )
    .gsub( /三月/                   , 'さんがつ' )
    .gsub( /三人/                   , 'さんにん' )
    .gsub( /四月/                   , 'しがつ' )
    .gsub( /四重唱/                 , 'しじゅうしょう' )
    .gsub( /１１/                   , 'しゅういち' )
    .gsub( /なさすらい人/           , 'すらいひと' )
    .gsub( /聖歌曲集/              , 'せいかきょくしゅう')
    .gsub( /大切な方/               , 'たいせつなかた' )
    .gsub( /月明り/                 , 'つきあかり' )
    .gsub( /七つ/                   , 'ななつ' )
    .gsub( /七人/                   , 'ななにん' )
    .gsub( /汝/                     , 'なんじ' )
    .gsub( /西風/                   , 'にしかぜ' )
    .gsub( /楡の木/                 , 'にれのき' )
    .gsub( /馭者/                   , 'はしゃ' )
    .gsub( /万霊節/                 , 'はんれいせつ' )
    .gsub( /(光|ひかり)の中/        , 'ひかりのなか' )
    .gsub( /一つ/                   , 'ひとつ' )
    .gsub( /一粒/                   , 'ひとつぶ' )
    .gsub( /人にもきたるものなれば/ , 'ひとにもきたるものなれば' )
    .gsub( /人はしらふでいる間は/   , 'ひとはしらふでいるあいだは' )
    .gsub( /一人/                   , 'ひとり' )
    .gsub( /２つ/                   , 'ふたつ' )
    .gsub( /二人/                   , 'ふたり' )
    .gsub( /魔王/                   , 'まおう' )
    .gsub( /山黄蝶/                 , 'まきちよう' )
    .gsub( /まとう人/               , 'まとうひと' )
    .gsub( /真夜中/                 , 'まよなか' )
    .gsub( /御子/                   , 'みこ' )
    .gsub( /三つ/                   , 'みっつ' )
    .gsub( /６つ/                   , 'むっつ' )
    .gsub( /森の中/                 , 'もりのなか' )
    .gsub( /８つ/                   , 'やっつ' )
    .gsub( /雪の鈴花/               , 'ゆきのすずはな' )
    .gsub( /寄す/                   , 'よす' )
    .gsub( /世捨て人/               , 'よすてひと' )
    .gsub( /４つ/                   , 'よっつ' )
    .gsub( /四十/                   , 'よんじゅう' )
    .gsub( /漁師/                   , 'りょうし' )
    .gsub( /禍い/                   , 'わざわい' )
    .gsub( /悪い人たちはみな」/     , 'わるいひとたちはみな' )
    .gsub( /(\p{hira})春(\p{hira})/, '\1はる\2' )
end

def yomi_sub_hash(k)
  yomi_db = {
    "愛" => "あい",
    "アイスキュロスよりの断片" => "あいすきゅろすよりのだんぺん",
    "哀悼歌（ネーニエ）" => "あいとううたねえにえ",
    "愛の歌" => "あいのうた",
    "愛の悲しみ" => "あいのかなしみ",
    "愛の神々を" => "あいのかみがみを",
    "愛の声" => "あいのこえ",
    "愛の言葉" => "あいのことば",
    "愛の春" => "あいのしゅん",
    "愛の立ち聞き" => "あいのたちぎき",
    "愛は偽りだった" => "あいはいつわりだった",
    "愛はどんな魔法よりすばらしい" => "あいはどんなまほうよりすばらしい",
    "アイヒェンドルフ歌曲集" => "あいひえんどるふかきょくしゅう",
    "愛らしき星たち" => "あいらしきほしたち",
    "秋" => "あき",
    "秋の歌" => "あきのうた",
    "あこがれ" => "あこがれ",
    "憧れ" => "あこがれ",
    "朝の歌" => "あさのうた",
    "朝焼けのもとのリラ" => "あさやけのもとのりら",
    "アデライーデ" => "あでらいで",
    "あなたは僕を愛していない" => "あなたはぼくをいとしていない",
    "（アヴェ・マリア）" => "あべ・まりあ",
    "あらゆる姿の恋人" => "あらゆるすがたのこいびと",
    "アリンデ" => "ありんで",
    "ある画家の歌の本よりの６つの詩" => "あるがかのうたのほんよりのむっつのし",
    "アルト・ラプソディ　Op.53" => "あると・らぷそでい",
    "ある古いスコットランドのバラード" => "あるふるいすこっとらんどのばらど",
    "アルプスの狩人" => "あるぷすのかりゅうど",
    "ある兵士の弔いの歌" => "あるへいしのとむらいのうた",
    "アンセルモの墓" => "あんせるものはか",
    "アンティゴネとオイディプス" => "あんていごねとおいでいぷす",
    "アンネ・リルの歌" => "あんね・りるのうた",
    "イーダのこと" => "いいだのこと",
    "イーダの白鳥の歌" => "いいだのはくちょうのうた",
    "イーダの夜の歌" => "いいだのよるのうた",
    "生きる勇気" => "いきるゆうき",
    "憩いのない恋" => "いこいのないこい",
    "イタリア歌曲集" => "いたりあかきょくしゅう",
    "５つの歌" => "いつつのうた",
    "５つのオフィーリアの歌" => "いつつのおふいりあのうた",
    "５つの歌曲" => "いつつのかきょく",
    "５つの小さな歌曲" => "いつつのちいさなかきょく",
    "５つのリートと歌" => "いつつのりととうた",
    "５つのロマンスと歌曲" => "いつつのろまんすとかきょく",
    "糸紡ぎの娘" => "いとつむぎのむすめ",
    "糸を紡ぐグレートヒェン" => "いとをつむぐぐれとひえん",
    "イフィゲニア" => "いふいげにあ",
    "妹のあいさつ" => "いもうとのあいさつ",
    "イルメリーネ" => "いるめりね",
    "岩の上の歌い手" => "いわのうえのうたいて",
    "岩の上の羊飼い" => "いわのうえのひつじかい",
    "うずらの鳴き声" => "うずらのなきごえ",
    "歌い手" => "うたいて",
    "歌い手の持ち物" => "うたいてのもちもの",
    "歌の終わり" => "うたのおわり",
    "美しきマゲローネ" => "うつくしきまげろね",
    "美しき水車小屋の娘" => "うつくしきみずぐるまこやのむすめ",
    "乳母の歌" => "うばのうた",
    "ウルフルが釣をするとき" => "うるふるがつりをするとき",
    "エピローグとして" => "えぴろぐとして",
    "エマへ" => "えまへ",
    "エリーザベト・クールマンの詩による７つのリート" => "えりざべと・くるまんのしによる７つのりと",
    "エルラフ湖" => "えるらふみずうみ",
    "エレンの歌" => "えれんのうた",
    "エレンの歌 I" => "えれんのうた１",
    "エレンの歌 II" => "えれんのうた２",
    "エレンの歌 III （アヴェ・マリア）" => "えれんのうた３あべ・まりあ",
    "老いの歌" => "おいのうた",
    "王女の夕べの歌" => "おうじょのゆうべのうた",
    "丘の上の若者" => "おかのうえのわかもの",
    "小川のほとりの若者" => "おがわのほとりのわかもの",
    "怒りの吟遊詩人" => "おこりのぎんゆうしじん",
    "怒りのデイアナに" => "おこりのでいあなに",
    "乙女の嘆き" => "おとめのなげき",
    "乙女の花" => "おとめのはな",
    "オリエントの歌" => "おりえんとのうた",
    "音楽に寄せて" => "おんがくによせて",
    "女の愛と生涯" => "おんなのあいとしょうがい",
    "解消" => "かいしょう",
    "海の静けさ" => "かいのしずけさ",
    "ガイベルによる３つの詩" => "かいべるによるみっつのし",
    "帰り道" => "かえりみち",
    "歌曲集「歌の花束」" => "かきょくしゅううたのはなたば",
    "歌曲と歌" => "かきょくとうた",
    "歌曲と歌 I" => "かきょくとうた１",
    "歌曲と歌 II" => "かきょくとうた２",
    "歌曲と歌 III" => "かきょくとうた３",
    "風の吹くときに" => "かぜのふくときに",
    "悲しみ" => "かなしみ",
    "悲しみの喜び" => "かなしみのよろこび",
    "ガニュメード" => "かにゅめど",
    "彼女に" => "かのじょに",
    "彼女の墓" => "かのじょのはか",
    "狩人の愛の歌" => "かりゅうどのあいのうた",
    "狩人の夕べの歌" => "かりゅうどのゆうべのうた",
    "川のほとりで" => "かわのほとりで",
    "歓迎とお別れ" => "かんげいとおわかれ",
    "外壁の内側に沿った小路にいるグレートヒェン/ グレートヒェンの祈り" => "かいへきのうちがわにそったしょうじにいるぐれとひえん／ぐれとひえんのいのり",
    "希望" => "きぼう",
    "希望そして愛" => "きぼうそしてあい",
    "君の瞳を見つめると" => "きみのひとみをみつめると",
    "君は花のように" => "きみははなのように",
    "君はわが憩い" => "きみはわがいこい",
    "郷愁" => "きょうしゅう",
    "ギリシャの神々" => "きりしゃのかみがみ",
    "くちづけを贈ろう" => "くちづけをおくろう",
    "クレメンス・ブレンターノの詩による６つの歌曲" => "くれめんす・ぶれんたののしによるむっつのかきょく",
    "クロエに" => "くろえに",
    "グレートヒェンの祈り" => "くれとひえんのいのり",
    "ゲーテ歌曲集" => "けいてかきょくしゅう",
    "結婚式の焼き肉" => "けっこんしきのやきにく",
    "ケルナーの詩による１２の歌曲" => "けるなのしによるじゅうにのかきょく",
    "劇音楽「ロザムンデ」　D 797" => "けきおんがくろざむんで",
    "恋する女が書いていること" => "こいするおんながかいていること",
    "恋する人に" => "こいするひとに",
    "恋する人のそばに" => "こいするひとのそばに",
    "恋の美酒" => "こいのびしゅ",
    "恋はあらゆる道の上に" => "こいはあらゆるみちのうえに",
    "幸福の世界" => "こうふくのせかい",
    "戸外にて" => "こがいにて",
    "五月の夜" => "こがつのよる",
    "五月への私の挨拶" => "こがつへのわたしのあいさつ",
    "９つの歌" => "ここのつのうた",
    "９つの歌曲と歌" => "ここのつのかきょくとうた",
    "湖上にて" => "こじょうにて",
    "（東風）" => "こち",
    "子と一緒の父親" => "こといっしょのちちおや",
    "小鳥" => "ことり",
    "孤独な男" => "こどくなおとこ",
    "この世からの別れ" => "このよからのわかれ",
    "こびと" => "こびと",
    "子守歌" => "こもりうた",
    "ゴンドラ乗り" => "こんどらのり",
    "婚礼の歌" => "こんれいのうた",
    "再会" => "さいかい",
    "最後の冗談" => "さいごのじょうだん",
    "「最後の葉」からの６つの歌曲" => "さいごのはからのむっつのかきょく",
    "「最後の葉」からの８つの詩" => "さいごのはからのやっつのし",
    "最初の痛み　最後の冗談" => "さいしょのいたみ　さいごのじょうだん",
    "罪を清められたオレステス" => "さいをきよめられたおれすてす",
    "酒盛りをするヴェレンシュタインの槍兵" => "さかもりをするべれんしゅたいんのやりへい",
    "盛りを過ぎた菩提樹" => "さかりをすぎたぼだいじゅ",
    "酒の歌" => "さけのうた",
    "酒飲みの歌" => "さけのみのうた",
    "さすらいの歌" => "さすらいのうた",
    "さすらい人" => "さすらいひと",
    "さすらい人が月に寄せて" => "さすらいひとがげつによせて",
    "さすらい人の夜の歌" => "さすらいひとのよるのうた",
    "去っていった人に" => "さっていったひとに",
    "去りし人のための夕べの歌" => "さりしひとのためのゆうべのうた",
    "讃歌" => "さんか",
    "讃歌 I" => "さんか１",
    "讃歌 II" => "さんか２",
    "讃歌 III" => "さんか３",
    "讃歌 IV" => "さんか４",
    "茂み" => "しげみ",
    "詩人の恋" => "しじんのこい",
    "詩人より　エピローグとして" => "しじんより　えぴろぐとして",
    "沈み行く太陽に" => "しずみいくたいように",
    "自然に寄せて" => "しぜんによせて",
    "自然の喜び" => "しぜんのよろこび",
    "死と少女" => "しとしょうじょ",
    "死にゆくひと" => "しにゆくひと",
    "死に寄せて" => "しによせて",
    "死の音楽" => "しのおんがく",
    "時の飛翔" => "ときしのひしょう",
    "至福" => "しふく",
    "１１の初期の歌" => "しゅういちのしょきのうた",
    "収穫の歌" => "しゅうかくのうた",
    "十字軍" => "しゅうぐん",
    "酒宴" => "しゅえん",
    "巡礼者" => "しゅんれいしゃ",
    "巡礼の道" => "しゅんれいのみち",
    "少女" => "しょうじょ",
    "商人の鑑" => "しょうにんのかがみ",
    "少年" => "しょうねん",
    "勝利" => "しょうり",
    "女声のための6つの歌" => "しょせいのためのむっつのうた",
    "シルヴィアに" => "しるびあに",
    "信仰　希望そして愛" => "しんこうきぼうそしてあい",
    "真珠" => "しんじゅ",
    "人生の勇気" => "しんせいのゆうき",
    "スペイン歌曲集　聖歌曲集" => "すぺいんかきょくしゅうせいかきょくしゅう",
    "スペイン歌曲集　世俗歌曲集" => "すぺいんかきょくしゅうせぞくかきょくしゅう",
    "スペインの愛の歌" => "すぺいんのあいのうた",
    "スペインの歌芝居" => "すぺいんのうたしばい",
    "スミレ" => "すみれ",
    "ズライカ I （東風）" => "すらいか１こち",
    "ズライカ II （西風）" => "すらいか２にしかぜ",
    "聖なる夜に想う" => "せいなるよるにおもう",
    "世俗歌曲集" => "せぞくかきょくしゅう",
    "セレナーデ" => "せれなで",
    "セレナード（きけきけひばり）" => "せれなどきけきけひばり",
    "潜水者" => "せんすいしゃ",
    "全能なるお方" => "せんのうなるおかた",
    "泉のほとりの若者" => "せんのほとりのわかもの",
    "葬送の幻影" => "そうそうのげんえい",
    "ソネット" => "そねっと",
    "ソネット I" => "そねっと１",
    "ソネット II" => "そねっと２",
    "ソネット III" => "そねっと３",
    "素朴な歌" => "そぼくなうた",
    "タイユフェ" => "たいゆふえ",
    "タウリスのオレステス" => "たうりすのおれすてす",
    "宝掘り" => "たからほり",
    "宝掘りの願い" => "たからほりのねがい",
    "竪琴によせて" => "たてごとによせて",
    "竪琴弾きの歌" => "たてごとひきのうた",
    "竪琴弾きの歌 II" => "たてごとひきのうた２",
    "竪琴弾きの歌 III" => "たてごとひきのうた３",
    "ため息" => "ためいき",
    "タルタルスの群れ" => "たるたるすのむれ",
    "誰が買うのか　愛の神々を" => "たれがかうのか　あいのかみがみを",
    "誰がしたのか" => "たれがしたのか",
    "耽溺" => "たんでき",
    "蝶々" => "ちょうちょう",
    "月に" => "つきに",
    "月に寄せて" => "つきによせて",
    "月の光" => "つきのひかり",
    "月の夕暮れ" => "つきのゆうぐれ",
    "釣り人" => "つりびと",
    "テークラ　：　霊の声" => "てくら：れいのこえ",
    "手袋" => "てぶくろ",
    "天上の光" => "てんじょうのひかり",
    "トゥーレの王" => "とうれのおう",
    "ドナウ川の上で" => "となうかわのうえで",
    "弔いの鐘" => "とむらいのかね",
    "囚われた歌びと" => "とらわれたうたびと",
    "捕らわれた狩人の歌" => "とらわれたかりゅうどのうた",
    "ナイチンゲールに寄せて" => "ないちんげるによせて",
    "流れ" => "ながれ",
    "流れの上で" => "ながれのうえで",
    "泣くこと" => "なくこと",
    "慰め" => "なぐさめ",
    "嘆き" => "なげき",
    "嘆きの歌" => "なげきのうた",
    "夏の安らぎ" => "なつのやすらぎ",
    "７つの歌曲" => "ななつのかきょく",
    "涙の賛美" => "なみだのさんび",
    "涙の中の慰め" => "なみだのなかのなぐさめ",
    "（西風）" => "にしかぜ",
    "人間の限界" => "にんげんのげんかい",
    "人間の魂" => "にんげんのたましい",
    "ネズミ捕り男" => "ねずみとりおとこ",
    "眠りの歌" => "ねむりのうた",
    "野ばら" => "のばら",
    "ノルナの歌" => "のるなのうた",
    "ノルマンの歌" => "のるまんのうた",
    "ハイネ、シェイクスピアとバイロン卿による４つの詩" => "はいね、しえいくすぴあとばいろんきょうによるよっつのし",
    "バイロンのヘブライ風歌曲よりの三つの歌" => "はいろんのへぶらいふうかきょくよりのみっつのうた",
    "墓掘り人の歌" => "はかほりびとのうた",
    "墓掘り人の憂い" => "はかほりびとのうれい",
    "墓掘りの歌" => "はかほりのうた",
    "白鳥の歌" => "はくちょうのうた",
    "馭者クロノスに" => "はしゃくろのすに",
    "初めてなくしたもの" => "はじめてなくしたもの",
    "バッカス賛歌" => "はっかすさんか",
    "ハデスへの旅" => "はですへのたび",
    "花の苦しみ" => "はなのくるしみ",
    "花の言葉" => "はなのことば",
    "花の便り" => "はなのたより",
    "母なる大地" => "ははなるだいち",
    "バラ" => "はら",
    "バラのリボン" => "はらのりぼん",
    "はるかな地への憧れ" => "はるかなちへのあこがれ",
    "春に" => "はるに",
    "春に寄せて" => "はるによせて",
    "春の歌" => "はるのうた",
    "春の小川に寄せて" => "はるのおがわによせて",
    "春への想い" => "はるへのおもい",
    "反映" => "はんえい",
    "反射" => "はんしゃ",
    "パンチ酒に" => "はんちしゅに",
    "万霊節の連祷" => "はんれいせつのれんとう",
    "聖歌曲集" => "ひじりかきょくしゅう",
    "ひそやかな愛" => "ひそやかなあい",
    "ヒッポリートの歌" => "ひっぽりとのうた",
    "羊飼い" => "ひつじかい",
    "羊飼いと騎士" => "ひつじかいときし",
    "羊飼いの嘆きの歌" => "ひつじかいのなげきのうた",
    "人質" => "ひとじち",
    "ひとつの思い　WoO.26-1" => "ひとつのおもい",
    "日々のうつろい" => "ひびのうつろい",
    "秘密" => "ひみつ",
    "秘密　フランツ・シューベルトに" => "ひみつ　ふらんつ・しゅうべるとに",
    "美も愛もここにいたことを！" => "ひもあいもここにいたことを！",
    "フィデレ" => "ふいでれ",
    "フィロクテート" => "ふいろくてと",
    "フォン・デア・ノインの６つの詩" => "ふおん・であ・のいんのむっつのし",
    "深い悩み" => "ふかいなやみ",
    "不機嫌の書よりの３つの歌曲" => "ふきげんのしょよりの３つのかきょく",
    "不幸な人" => "ふこうなひと",
    "双子座の星に寄せる舟人の歌" => "ふたござのほしによせるふなびとのうた",
    "２つの歌曲" => "ふたつのかきょく",
    "船乗りの別れの歌" => "ふなのりのわかれのうた",
    "舟人" => "ふなびと",
    "冬の歌" => "ふゆのうた",
    "冬の旅" => "ふゆのたび",
    "冬の夕べ" => "ふゆのゆうべ",
    "ブランカ" => "ふらんか",
    "フランツ・シューベルトに" => "ふらんつ・しゅうべるとに",
    "フリードリヒ・ヘルダーリンの3つの讃歌" => "ふりどりひ・へるだーりんのみっつのさんか",
    "古き調べ：ゴットフリート・ケラーの６つの詩" => "ふるきしらべ：ごっとふりと・けらのむっつのし",
    "ブルックにて" => "ふるっくにて",
    "プロメテウス" => "ふろめてうす",
    "ブロンデルからマリア様に" => "ふろんでるからまりあさまに",
    "兵隊さんの歌" => "へいたいさんのうた",
    "ヘクトルの別れ" => "へくとるのわかれ",
    "ベニヒワの愛のさえずり" => "へにひわのあいのさえずり",
    "ベラ荘のクラウディーネ" => "へらそうのくらうでいね",
    "ヘリオポリスより" => "へりおぽりすより",
    "ヘリオポリスより I" => "へりおぽりすより１",
    "ヘリオポリスより II" => "へりおぽりすより２",
    "ベルシャザル" => "へるしゃざる",
    "ベルタの夜の歌" => "へるたのよるのうた",
    "星たち" => "ほしたち",
    "星の夜" => "ほしのよる",
    "魔王" => "まおう",
    "ます" => "ます",
    "窓辺で" => "まどべで",
    "真夜中に" => "まよなかに",
    "マリア" => "まりあ",
    "マリア様の苦しみに" => "まりあさまのくるしみに",
    "ミケランジェロ歌曲集" => "みけらんじえろかきょくしゅう",
    "湖の上で" => "みずうみのうえで",
    "湖のほとりで" => "みずうみのほとりで",
    "みずから沈み行く者" => "みずからしずみいくもの",
    "水車小屋の生活" => "みずぐるまこやのせいかつ",
    "水の上で歌う" => "みずのうえでうたう",
    "満ち溢れる愛" => "みちこぼれるあい",
    "３つの愛の歌" => "みっつのあいのうた",
    "３つの歌" => "みっつのうた",
    "三つの歌" => "みっつのうた",
    "３つのオフィーリアの歌" => "みっつのおふいりあのうた",
    "３つの歌曲" => "みっつのかきょく",
    "３つの二重唱" => "みっつのにじゅうしょう",
    "３つの古いドイツの歌" => "みっつのふるいどいつのうた",
    "緑の歌" => "みどりのうた",
    "ミニヨンに" => "みによんに",
    "ミニヨンの歌" => "みによんのうた",
    "ミニヨンの歌 II" => "みによんのうた２",
    "ミューズの子" => "みゅずのこ",
    "ミリアムの勝利の歌" => "みりあむのしょうりのうた",
    "ミルテの花" => "みるてのはな",
    "昔の恋は決して錆びつかない" => "むかしのこいはけっしてさびつかない",
    "矛盾" => "むじゅん",
    "６つの歌" => "むっつのうた",
    "６つの歌曲" => "むっつのかきょく",
    "６つの詩とレクイエム" => "むっつのしとれくいえむ",
    "ムラサキバナ（ハナダイコン）" => "むらさきばなはなだいこん",
    "メアリー＝スチュワート女王の詩による５つの詩" => "めあり＝すちゅわとじょおうのしによるいつつのし",
    "冥界に下る時のオルフェウスの歌" => "めいかいにくだるときのおるふえうすのうた",
    "メーリケ歌曲集" => "めいりけかきょくしゅう",
    "メタスタージオの３つの歌" => "めたすたじおの３つのうた",
    "メムノン" => "めむのん",
    "盲目の少年" => "もうもくのしょうねん",
    "森の中で" => "もりのなかで",
    "森の中の夜の歌" => "もりのなかのよるのうた",
    "森の夜（森にて）" => "もりのよるもりにて",
    "夜曲" => "やきょく",
    "８つの歌とロマンス" => "やっつのうたとろまんす",
    "８つの歌曲" => "やっつのかきょく",
    "８つの歌曲と歌" => "やっつのかきょくとうた",
    "山々" => "やまやま",
    "友人たちへ" => "ゆうじんたちへ",
    "夕映えの中で" => "ゆうばえのなかで",
    "夕べの歌" => "ゆうべのうた",
    "夕べの情景" => "ゆうべのじょうけい",
    "夕星" => "ゆうぼし",
    "夕焼け" => "ゆうやけ",
    "良き夜に" => "よきよるに",
    "ヨーゼフ・シュパウン氏に" => "よぜふ・しゅぱうんしに",
    "４つの歌" => "よっつのうた",
    "４つの歌曲" => "よっつのかきょく",
    "４つのカンツォーネ" => "よっつのかんつおね",
    "４つの厳粛な歌" => "よっつのげんしゅくなうた",
    "４つの最後の歌" => "よっつのさいごのうた",
    "４つの４重唱曲" => "よっつのしじゅうしょうきょく",
    "４つのデュエット" => "よっつのでゅえっと",
    "４つの二重唱" => "よっつのにじゅうしょう",
    "４つのリフレイン歌曲" => "よっつのりふれいんかきょく",
    "ヨハンナ・ゼーブス" => "よはんな・ぜぶす",
    "夜と夢" => "よるとゆめ",
    "夜の歌" => "よるのうた",
    "夜の賛歌" => "よるのさんか",
    "ラクリマスよりの２つの劇唱" => "らくりますよりのふたつのげきしょう",
    "リアーネ" => "りあね",
    "リチャード獅子心王のロマンス" => "りちゃあどしししんおうのろまんす",
    "リート" => "りと",
    "リート（満足）" => "りとまんぞく",
    "リュートに" => "りゅうとに",
    "リュッケルトの５つの詩" => "りゅっけるとのいつつのし",
    "漁師" => "りょうし",
    "漁師の愛の喜び" => "りょうしのあいのよろこび",
    "漁師の歌" => "りょうしのうた",
    "林の中で" => "りんのなかで",
    "リーゼンコッペの頂上で" => "りーぜんこっぺのちょうじょうで",
    "リーダークライス" => "りーだくらいす",
    "ルイーゼの返答" => "るいぜのへんとう",
    "霊のあいさつ" => "れいのあいさつ",
    "霊の声" => "れいのこえ",
    "レーナウの詩による２つの歌曲" => "れなうのしによるふたつのかきょく",
    "ロマンスとバラード" => "ろまんすとばらど",
    "ロマンスとバラード I" => "ろまんすとばらど１",
    "ロマンスとバラード II" => "ろまんすとばらど２",
    "ロマンスとバラード III" => "ろまんすとばらど３",
    "ロマンスとバラード IV" => "ろまんすとばらど４",
    "若い尼僧" => "わかいにそう",
    "若者と死神" => "わかものとしにがみ",
    "若者のための歌のアルバム" => "わかもののためのうたのあるばむ",
    "別れ" => "わかれ",
    "わがクラヴィーアに寄せて" => "わがくらゔいあによせて",
    "わが心に" => "わがしんに",
    "忘れて草の花" => "わすれてそうのはな",
    "忘れな草" => "わすれなそう",
    "私の父のお墓の前で" => "わたしのちちのおはかのまえで",
    "私のゆりかごの前で" => "わたしのゆりかごのまえで",
    "笑いと涙" => "わらいとなみだ",
    "ヴィルデマンを越えて" => "ういるでまんをこえて",
    "ヴィルヘルム・マイスター修業時代" => "ういるへるむ・まいすたしゅぎょうじだい",
    "ヴィルヘルム・マイスターよりの歌" => "ういるへるむ・まいすたよりのうた",
    "ヴィルヘルム・マイスターよりの歌曲と歌" => "ういるへるむ・まいすたよりのかきょくとうた",

  }
  yomi_db[k]
end

if __FILE__ == $0 then main end
